import { techTypes } from "./technologies";

export const PROJECTS_DATA = [
  {
    slug: "memdalet",
    title: "מ.ד. הדפסות",
    inShort:
      "חנות אינטרנטית להדפסה על פרטי לבוש. המשתמש בוחר את פרטי המוצר, מעלה קובץ גלופה, וממלא פרטים. באזור ניהול מנהלי אתר יכולים לנהל את כל ההזמנות, לצפות בסטטיסטיקות, לשלוח לחברת משלוחים בקשה למשלוח, ועוד",
    customerNeed:
      "לפני פיתוח האתר, כל ניהול ההזמנות והלקוחות של העסק (שהיה אז בתחילת דרכו) התבצע בצורה ידנית ולא מסודרת באמצעות קבצי אקסל, התכתבויות בWhatsapp-, ובעל פה. אתם יכולים לנחש שהתנהלות כזו הובילה לאיבוד מידע, איבוד זמן, מתח נפשי גבוה, טעויות בהזמנות, מוניטין שלא ממריא, וכו׳…\nעל כן הלקוח ביקש לפתח עבורו מערכת ניהול ייחודית לעסק שלו, שתכלול ביצוע הזמנות דרך האתר (ולא עוד דרך הWhatsapp!), ניהול ומעקב אחרי הזמנות, ניהול מוצרים ומלאי, התממשקות לחברת משלוחים בלחיצת כפתור, שמירת נתונים לצורך סטטיסטיקות, מעקב אחרי מאזן הכנסות, וניהול משתמשים וכרטיסי מועדון, יצירת קשר מקוונת (והיד עוד נטויה…).",
    developmentProcess:
      "תהליך הפיתוח כלל איפיון פיתוח ובדיקות, ועיצוב האתר התקבל ממעצבת מטעם הלקוח.\nבצד הלקוח, הפיתוח נעשה ללא כל framework, אלא ממש vanila javascript, html, css. (שזה היה ממש קשה אבל מחשל :) )\nבצד שרת השתמשתי בnodejs. כמו כן השתמשתי בשירותי ה-api של חברת המשלוחים צ׳יטה.",
    technologies: [
      techTypes.nodejs,
      techTypes.javascript,
      techTypes.html,
      techTypes.css,
    ],
    impact:
      "פיתוח המערכת יצר ללקוח סביבת עבודה נוחה, מהירה ומודרנית, ללא צורך להתעסק בתפל (כי בשביל זה יש מחשבים, לא?). כמו כן שביעות הרצון של הלקוחות מהמערכת הביאה לפרסום מפה לאוזן, לעליה משמעותית במכירות. בנוסף, הצגת נתוני הסטטיסטיקות באתר אפשרה ללקוח לנתח את השוק בצורה מיטבית ולחזות התנהגות לקוחות עתידית.",
  },
  {
    slug: "vogo",
    title: "ווגו",
    inShort:
      "מערכת המקשרת בין עובדי היטק מתחילים לבין עמותות הצריכות מוצר טכנולוגי. המתלמדים לומדים לעבוד בצוות עם שאר התפקידים השונים, יחד עם ליווי מקצועי של אנשי מקצוע, ובסופו של דבר מוציאים מוצר בעל ערך משמעותי וחיובי.",
    customerNeed:
      "הלקוחות הינם יזמים צעירים הבאים מתחום ההיטק, שרצו לסייע למתלמדים רבים בעולם הפיתוח למצוע עבודה ולהיכנס לשוק. כיום המתחילים בפיתוח סובלים מקושי רב בכניסה לשוק, על אחת כמה וכמה עם המצב הנוכחי בשוק. על כן התבקשתי לפתח עבור המיזם מערכת שתנהל את המשתמשים ואת עבודות הפיתוח הדרושות מהעמותות, תאפשר למתלמדים להגיש בקשה להצטרפות לפרוייקט, ותנהל את העמותות השונות.",
    developmentProcess:
      "תהליך הפיתוח כלל איפיון פיתוח ובדיקות, ועיצוב האתר התקבל ממעצבת מטעם הלקוח.\nבצד הלקוח, הפיתוח נעשה בראקט, עם סיפריית material.\nבצד שרת השתמשתי בnodejs. כמו כן השתמשתי בשירותים של פיירבייס לצורך הזדהות, סנדגריד לצורך שליחת מיילים, קלאודינרי לצורך העלאת וקבלת תמונות, ובבסיס נתונים mongo",
    technologies: [
      techTypes.nodejs,
      techTypes.firebase,
      techTypes.mongodb,
      techTypes.cloudinary,
      techTypes.react,
      techTypes["material-ui"],
    ],
    impact: "לאחר הפיתוח, ......",
  },
  {
    slug: "simana",
    title: "סימנא",
    inShort:
      "יישומון אינטרנטי המציע דרך קלילה ומהנה ללימוד טעמי מקרא וקריאה בתורה. מתאים גם למתחילים וגם לותיקים. ניתן לפתוח בפרשת השבוע, לדנות עיצוב, לשמור סימניות, לשמוע וללמוד טעמים בשלושת הנוסחים העיקריים, ועוד",
    customerNeed:
      "היישומון הזה פותח ביוזמה שלי. בתור קורא בתורה לעיתים, נוכחתי לדעת שאין דרך מספיק קלה ונוחה (ומהנה!) ללימוד טעמי המקרא וללימוד קריאת התורה, יחסית לאפשרויות הרבות שהטכנולוגיה בזמננו מציעה. בנוסף, היישומונים הקודמים הציגו את הדף שלא בצורתו השכיחה, מה שהקשה על הלימוד.\nעל כן נרתמתי לפתח אפליקציה שתהיה נוחה לשימוש, אינטואיטיבית, בעלת עיצוב יותר 'צעיר', ובצורת הדף המקורית של סךר תורה, שמתאימה למתלמדים מתחילים הכוללת מדריך בתחילת היישומון ולימוד טעמים בנוחסים הנפוצים בציבור.",
    developmentProcess:
      'תהליך הפיתוח כלל איפיון פיתוח ובדיקות, ועיצוב האתר נעשה ע"י אריאל לוק.\nבצד הלקוח, הפיתוח נעשה בראקט, עם סיפריית material. בטכנולוגיית PWA, מה שאומר שהפיתוח נגיש גם בחניות האפליקציות וגם כאתר אינטרנט, מה שפותח את היישומון לשלל סוגי משתמשים, הן בטלפונים חכמים והן במחשב.\nבצד שרת השתמשתי בnodejs.',
    technologies: [
      techTypes.nodejs,
      techTypes.react,
      techTypes["material-ui"],
      techTypes.pwa,
    ],
    impact:
      "הוצאת המוצר לאור יצרה ממש הד ציבורי, מה שמעיד על הצורך הגדול שהוא בא לפתור\nהמון תגובות חיוביות, הורדות, ואפילו כמה תותחים שתרמו לצורך המשך פיתוח",
  },
  {
    slug: "",
    title: "",
    inShort: "",
    customerNeed: "",
    developmentProcess: "",
    technologies: "",
    impact: "",
  },
  {
    slug: "",
    title: "",
    inShort: "",
    customerNeed: "",
    developmentProcess: "",
    technologies: "",
    impact: "",
  },
  {
    slug: "",
    title: "",
    inShort: "",
    customerNeed: "",
    developmentProcess: "",
    technologies: "",
    impact: "",
  },
];
