const RECOMMENDATIONS = [
  {
    description:
      "תענוג לעבוד עם ינון, מהתכנון של האתר ברעיון ועד שהוא הביא את זה למוצר מוגמר הכל מושלם!\nהשקיע את כל הנשמה בעבודה. ואני שמח שינון הוא זה שעשה לי את האתר\nלא הייתי יכול לבקש דרך קלה יותר לאתר מושלם!",
    profile: {
      imageFilename: "profile1.png",
      role: "בעלים של מ.ד. הדפסות",
      name: "מיכאל מנריקס",
    },
  },
  {
    description:
      "מעבר לעבודה המדויקת והמקצועית של ינון, פגשתי באיש מקצוע ישר, מקצועי ואחראי.\nינון הקפיד לעדכן לאורך כל העבודה יחד, תוך שהוא מסביר ומציג את השלבים שעוברים יחד.\nהזריזות בשילוב מקצועיות ואמינות הביאה לתוצר מקצועי בדיוק כמו שדימיינתי.\nאין ספק שהעבודה עם ינון משתלמת ומוכיחה את עצמה.",
    profile: {
      imageFilename: "amitai.jpg",
      role: "היזם של ווגו",
      name: "אמיתי אלירם",
    },
  },
//   {
//     description: "",
//     profile: {
//       imageUrl: "",
//       role: "",
//       name: "",
//     },
//   },
//   {
//     description: "",
//     profile: {
//       imageUrl: "",
//       role: "",
//       name: "",
//     },
//   },
];

export default RECOMMENDATIONS;